//================================================================================
// 入力パラメータ
//================================================================================
struct VS_INPUT		// 頂点シェーダ
{
	float4 position : POSITION;
	float4 color : COLOR;
};

//================================================================================
// 出力パラメータ
//================================================================================
struct VS_OUTPUT	// 頂点シェーダ
{
	float4 position : SV_POSITION;
	float4 color: COLOR;
};

//================================================================================
// 頂点シェーダ
//================================================================================
VS_OUTPUT VSMain(VS_INPUT input)
{
	VS_OUTPUT output;

	// 加工なしでそのまま出力
	output.position = input.position;
	output.color = input.color;

	return output;
}

// ピクセルシェーダ入力パラメータ
typedef VS_OUTPUT PS_INPUT;		// 置き換え
// 頂点シェーダのアウトプットがそのままピクセルシェーダのインプットになるので、
// 分かりやすいように名前の置き換えを行う。

//================================================================================
// ピクセルシェーダ
//================================================================================
float4 PSMain(PS_INPUT input) : SV_TARGET
{
	// そのまま出力
	return input.color;
}
